{
  "home": "Home",
  "about": "About",
  "contact": "Contact",
  "projects": "Projects",
  "name": "Jinghan Wang",
  "morning": "Good Morning, ",
  "afternoon": "Good Afternoon, ",
  "evening": "Good Evening, ",
  "welcome": "Welcome to my website!",
  "aboutme": "About Me",
  "website": "Website",
  "paper": "Paper",
  "video": "Video",
  "friend": "Friend Link",
  "portfolios": "Portfolios",
  "source": "Source code",
  "jumpTitle": "Potential Delay in Server Response",
  "jumpContent": "The website takes a slight delay in receiving responses from the service. Consequently, if there is no immediate reaction upon clicking buttons, please be patient and wait for a while.",
  "jumpButton": "I understand",
  "jumpDismiss": "Don't show this again",
  "project": [
    {
      "logo": "react.svg",
      "type": "React",
      "title": "My Airbnb",
      "description": "Web application for Property Trading similar to #:aAirbnb[https://www.airbnb.com.au/]#.",
      "content": [
        {
          "type": "title",
          "content": "Feature Description:"
        },
        {
          "type": "text",
          "content": "This project designed to provide a convenient intermediary platform for landlords and renters, allows landlords to publicly share their property information, while renters can easily browse, search, and book these listings. Specifically, the app supports the following features:"
        },
        {
          "type": "list",
          "content": [
            "User Registration and Login",
            "Uploading Property Photos and Information",
            "Search and Filter Functionality",
            "Online Booking Functionality"
          ]
        },
        {
          "type": "title",
          "content": "Technology Stack:"
        },
        {
          "type": "text",
          "content": "This project was my first major assignment using the React framework. I adopted TypeScript to ensure high code quality and maintainability. For routing management, I used React Router's BrowserRouter component to create a dynamic and responsive single-page application (SPA). Due to the minimal need for global state, I chose React's Context API over Redux for state management, which met the application's needs while keeping the architecture simple."
        },
        {
          "type": "text",
          "content": "In terms of interface design, I used Material UI (MUI) as the main UI framework, which not only sped up development but also ensured a modern and responsive look for the application."
        },
        {
          "type": "text",
          "content": "To ensure code stability and quality, as per the assignment requirements, I used Jest for unit testing three key components. Additionally, I used Cypress for end-to-end UI testing to ensure overall application stability and user experience."
        },
        {
          "type": "text",
          "content": "Overall, this project enhanced my front-end development skills, especially in using React and related technology stacks. A shortcoming, however, was the tight coupling of multiple components within the React framework due to extensive data interactions between different components. This strategy avoided complex management of global state to some extent but reduced code reusability and limited testing convenience. In future projects, a more refined component division is needed to reduce inter-component coupling and enhance code maintainability, testability, and scalability."
        }
      ],
      "link": "https://enmmmmovo.github.io/Airbnb/",
      "repo": "https://github.com/EnmmmmOvO/Airbnb",
      "imageSize": 60,
      "image": [
        "airbnb/logo.svg",
        "airbnb/1.png",
        "airbnb/2.png",
        "airbnb/3.png",
        "airbnb/4.png",
        "airbnb/5.png",
        "airbnb/6.png",
        "airbnb/7.png"
      ]
    },
    {
      "logo": "kaggle.png",
      "type": "Neural Network",
      "title": "Stable Diffusion - Image to Prompts",
      "description": "Generate prompt words that align with the content of the input images.",
      "content": [
        {
          "type": "title",
          "content": "Project Concept and Model Selection"
        },
        {
          "type": "text",
          "content": "This project is inspired by a #:aKaggle[https://www.kaggle.com/competitions/stable-diffusion-image-to-prompts]# competition. We selected two distinct models for implementation and comparative analysis: the #:iCLIP# model and the #:iResnet + LSTM# model. The objective was to train both models separately and then conduct a macro-level comparison to evaluate their strengths and weaknesses."
        },
        {
          "type": "title",
          "content": "Model Training and Optimization"
        },
        {
          "type": "text",
          "content": "Each model was built upon its respective pre-trained framework. We employed the Adam optimizer and a learning rate scheduler during the training process to facilitate model convergence and enhance the overall training results. For both models, the test and validation sets were sourced from the #:iDiffusionDB# dataset in #:aHugging Face[https://huggingface.co/datasets/poloclub/diffusiondb]#, following adequate preprocessing."
        },
        {
          "type": "title",
          "content": "My Contribution - #:iResnet + LSTM# Model"
        },
        {
          "type": "text",
          "content": "As a member of the team, my responsibility was to implement and train the #:Resnet + LSTM# model. The primary process involved:"
        },
        {
          "type": "list",
          "content": [
            "#:bFeature Extraction#: Utilizing the #:iResNet-50# model to extract features from input images.",
            "#:bFeature Mapping#: Mapping these extracted features to the input dimensions of the #:iGPT-2# model through a linear layer.",
            "#:bText Generation#: Processing these features via an #:iLSTM# layer to generate an initial textual description of the image.",
            "#:bText Refinement#: Using the #:iGPT-2# model to refine the initial description into a comprehensive final image description."
          ]
        },
        {
          "type": "text",
          "content": "The entire training procedure for my part was conducted on Kaggle's #:iGPU-P100#."
        },
        {
          "type": "title",
          "content": "Training Outcome and Analysis"
        },
        {
          "type": "text",
          "content": "After about 7 epochs of training, the loss metric of the #:iResnet + LSTM# model plateaued and did not show further improvement. In comparison with the #:iCLIP# model, there was a notable variance from the actual original prompts. The potential reasons identified for this discrepancy are:"
        },
        {
          "type": "list",
          "content": [
            "#:bModel Architecture#: The project required the handling of both images and text. The #:iCNN# (Convolutional Neural Network) was employed for image processing and the #:iRNN# (Recurrent Neural Network) for text processing. The interlinking layer, designed to map the output of the #:iCNN# to the input of the #:iRNN#, might have been too rigid. This potentially led to less effective feature extraction and integration compared to the #:ViT# model in #:CLIP#, known for its efficient image-text correspondence.",
            "#:bParameter Optimization and Time Constraints#: Limited time for the project might have resulted in insufficient adjustment and optimization of certain model parameters. This could have contributed to the challenges faced in achieving effective convergence during the training process."
          ]
        }
      ],
      "repo": "https://github.com/GATA-Chen/COMP9417_Project",
      "paper": "documents/9417%20Report.pdf",
      "imageSize": 80,
      "image": [
        "imageToPrompt/logo.svg",
        "imageToPrompt/1.png",
        "imageToPrompt/2.png",
        "imageToPrompt/3.png",
        "imageToPrompt/4.png"
      ]
    },
    {
      "logo": "fastapi.svg",
      "type": "FastAPI + React",
      "title": "CONEX",
      "description": "Web Platform for Connecting Professionals with Projects.",
      "content": [
        {
          "type": "title",
          "content": "Project Overview"
        },
        {
          "type": "text",
          "content": "This project is a collaborative full-stack team initiative aimed at creating a web platform for both company and professional users. The platform is designed to facilitate professional users in applying for, participating in, and evaluating various projects. For company users, it offers functionalities to create and approve projects."
        },
        {
          "type": "title",
          "content": "Front End and Back End Technologies"
        },
        {
          "type": "text",
          "content": "For the front end, we chose the #:iReact# framework for its dynamic and user-friendly interface. The backend is developed using #:iFastAPI#, #:iSQLAlchemy#, and #:iSQLite3#, which collectively enhance the interaction between the database and backend operations."
        },
        {
          "type": "title",
          "content": "Platform Features"
        },
        {
          "type": "list",
          "content": [
            "User registration and login.",
            "Project posting and application filtering for company users.",
            "Project application functionality for professional users.",
            "A mutual evaluation system among users."
          ]
        },
        {
          "type": "title",
          "content": "My Role in the Project"
        },
        {
          "type": "list",
          "content": [
            "Backend development, focusing on both the design and implementation of the database.",
            "Design and deployment of email functionalities.",
            "Development of specific front-end pages, including the logic for URL redirections in emails."
          ]
        },
        {
          "type": "title",
          "content": "Database Design and Backend Logic"
        },
        {
          "type": "text",
          "content": "The database design and fundamental backend logic are comprehensively outlined in #:athis document[https://enmmmmovo.cloudns.be/documents/backgorund%20logic.pdf]#. We adhered to concurrency principles in database interactions, using sessions for concurrency control and #:iSQLAlchemy# transactions for concurrent database management."
        },
        {
          "type": "title",
          "content": "Email Functionality and Front End Implementation"
        },
        {
          "type": "text",
          "content": "For the email component, #:iPython's SMTP# library was used for sending emails with direct user access URLs. On the front end, #:iReact's# router was employed to manage URL redirections, allowing users to navigate back to their previous page after logging in."
        }
      ],
      "imageSize": 80,
      "image": [
        "conex/logo.svg",
        "conex/1.png",
        "conex/2.png",
        "conex/3.png",
        "conex/4.png",
        "conex/5.png",
        "conex/6.png",
        "conex/7.png",
        "conex/8.png",
        "conex/9.png",
        "conex/10.png",
        "conex/11.png",
        "conex/12.png"
      ]
    },
    {
      "logo": "js.svg",
      "type": "Vanilla JS",
      "title": "Slackr",
      "description": "Multi-functional social and communication platform supporting message and image sharing.",
      "content": [
        {
          "type": "title",
          "content": "Feature Description:"
        },
        {
          "type": "text",
          "content": "This project is a chat application modeled after #:aDiscord[https://discord.com/]#, with an icon derived from #:aSlack[https://slack.com/intl/en-gb/]#, upon which certain modifications have been made. It features user registration and login, channel creation and joining, sending of text and images, user profile editing, channel invitations, and more."
        },
        {
          "type": "title",
          "content": "Technology Stack:"
        },
        {
          "type": "text",
          "content": "This project is a pure #:iHTML#, #:iCSS#, and #:iJavaScript# front-end endeavor, utilizing #:iAJAX# to facilitate asynchronous web page updates through data exchanges with a backend web server. As the project employs #:iVanilla JavaScript#, all interactions are implemented as #:iJavaScript# event handlers. The #:iHTML# contains only a basic framework; specific information and functionalities are dynamically added to the #:iDOM# by #:iJavaScript#. For the UI aspect, #:iBootstrap 5# is used as the foundational framework, incorporating its components like modals, toasts, and navbars for aesthetic enhancement."
        },
        {
          "type": "title",
          "content": "Limitations:"
        },
        {
          "type": "text",
          "content": "As my first front-end project, it lacked comprehensive initial design planning, resulting in some disorganization in interactions with the backend, which was provided by another party. Without backend support for continuous retrieval of new messages, the application can only load chat data upon opening any channel, thus it does not update chat information in real-time like #:aDiscord[https://discord.com/]# or #:aSlack[https://slack.com/intl/en-gb/]#."
        },
        {
          "type": "text",
          "content": "The #:iUI# has several areas with oversized fonts, potentially affecting aesthetic appeal on mobile devices. Additionally, the photo display may not have accounted for images exceeding boundary limits, possibly leading to incomplete image visibility issues."
        }
      ],
      "link": "https://enmmmmovo.github.io/Slackr/",
      "repo": "https://github.com/EnmmmmOvO/Slackr",
      "imageSize": 50,
      "image": [
        "slackr/logo.svg",
        "slackr/2.png",
        "slackr/1.png",
        "slackr/3.png",
        "slackr/4.png",
        "slackr/5.png",
        "slackr/6.png",
        "slackr/7.png"
      ]
    },
    {
      "logo": "network.svg",
      "type": "Network Protocol",
      "title": "Terminal chat room",
      "description": "",
      "content": [

      ],
      "paper": "documents/chat%20platform%20report.pdf",
      "repo": "https://github.com/EnmmmmOvO/UNSW-Computer-Science/tree/master/COMP3331/assign",
      "imageSize": 80,
      "image": [
        "chat/logo.svg",
        "chat/1.png",
        "chat/2.png",
        "chat/3.png"
      ]
    }
  ],
  "portfolio": [
    {
      "logo": "astronomy.svg",
      "type": "Astronomy",
      "title": "Fantastic Celestial Objects",
      "paper": "documents/APOD.pdf",
      "description": "This is a popular science magazine geared towards readers with little or no knowledge of the cosmos. Its primary aim is to introduce various celestial bodies (stars, planets, satellites) that constitute the vast expanse of the universe, discussing their types, structures, and potential evolutionary processes. There may be instances of non-professional explanations or inaccuracies within the content, and corrections or clarifications are welcome.",
      "image": "galaxy.png"
    },
    {
      "logo": "computer.svg",
      "type": "Computer Ethics",
      "title": "Balancing Ethics and Efficiency: Autonomous Vehicles and Utilitarianism",
      "paper": "documents/utilitarianism_and_autonomous_vehicles.pdf",
      "description": "This article explores the ethical considerations of applying Act and Rule Utilitarianism to the collision-avoidance protocols in autonomous vehicles, analyzing the impact of each approach on decision-making in critical scenarios, and evaluating their implications for societal norms and technological design in the context of autonomous driving.",
      "image": "utilitarianism.png"
    },
    {
      "logo": "computer.svg",
      "type": "Computer Ethics",
      "title": "The Ethical Challenges of AI in Artistic Creation",
      "paper": "documents/Drawing_AI.pdf",
      "description": "This article delves into the ethical implications and challenges of AI drawing technologies in the realm of art, focusing on how AI is reshaping the boundaries of artistic creation, copyright, and originality, as well as the appropriateness of AI technologies in art competitions.",
      "image": "drawingAI.png"
    },
    {
      "logo": "go.svg",
      "type": "Concurrency (Go)",
      "title": "Suzuki-Kasami Concurrency Algorithm",
      "video": "https://www.youtube.com/watch?v=pEkQOzhP_D4",
      "repo": "https://github.com/EnmmmmOvO/UNSW-Computer-Science/tree/master/COMP3151/23T2/ass2",
      "description": "This video critically analyzes the advantages and shortcomings of the Suzuki-Kasami algorithm for token-based concurrency in distributed environments, while concurrently examining the merits of channel-based concurrent programming in the Go language from an academic perspective.",
      "image": "go.png"
    },
    {
      "logo": "java.svg",
      "type": "Concurrency (Java)",
      "title": "Implementing Concurrent Operation of a Data Set",
      "paper": "documents/Java_Concurrency.pdf",
      "repo": "https://github.com/EnmmmmOvO/UNSW-Computer-Science/tree/master/COMP3151/23T2/ass1",
      "description": "This article mainly utilizes read-and-write locks as the main body to ensure that only one process is allowed to run if and when the data needs to be modified, and multiple processes can read the data if there are no writes. In addition, signalling is used to ensure the integrity of the data structure.",
      "image": "javaConcurrency.png"
    },
    {
      "logo": "astronomy.svg",
      "type": "Astronomy",
      "title": "James Webb Space Telescope",
      "paper": "documents/PHYS1160_Report_2.pdf",
      "description": "This article focuses on the James Webb Space Telescope, the successor to the Hubble telescope, including its launch purpose, structure, orbit, and reasons for the launch. Finally, it pays more attention to the results obtained more than a year after the launch and its contribution to astronomy.",
      "image": "webb.webp"
    },
    {
      "logo": "astronomy.svg",
      "type": "Astronomy",
      "title": "Short Report about Astronomy",
      "paper": "documents/PHSY1160_Report_1.pdf",
      "description": "The article primarily focuses on exploring the possibility of finding extraterrestrial life by examining the structural features of galaxies and searching for planets that could support carbon-based life forms.",
      "image": "astro.png"
    }
  ]
}